2DSlantRoof/roofSlant2D/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
     #includeEtc "caseDicts/setConstraintTypes"

	inlet
	{
		type  codedFixedValue;
		value $internalField;
		name ablProfile;
		
		code
		#{
		const fvPatch& boundaryPatch = patch();
		const vectorField& Cf = boundaryPatch.Cf();
		vectorField& field = *this;   
		
		scalar Ut = 8, hb = 5, z0 = 0.017;//input values
		
		forAll(Cf, faceI)
		{
			const scalar y = Cf[faceI].y();
			const scalar Ux = (Ut / log( (hb+z0) / z0)) * log( (y+z0) / z0);
			field[faceI] = vector(Ux, 0.0, 0.0);	 
		} 
		#};
			 
		codeOptions
		#{
		-I$(FOAM_SRC)/finiteVolume/lnInclude \
		-I$(FOAM_SRC)/meshTools/lnInclude
		#};
		
		// codeInclude
		// #{
		// #include "fvCFD.H"
		// #include <cmath>
		// #include <iostream>
		// #};
    }

    outlet
    {
        type            zeroGradient;
    }

    top
    {
        type            zeroGradient;
    }

    building
    {
        type            noSlip;
    }

    ground
    {
        type            noSlip;
    }

    "(front|back)"
    {
        type            empty;
    }
}


// ************************************************************************* //
