2DSlantRoof/roofSlant2D/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform .375; // 0.061%

boundaryField
{
    inlet
    {
	#includeEtc "caseDicts/setConstraintTypes"
        type  codedFixedValue;
		value $internalField;
		name ablProfile_k;
		
		code
		#{
		const fvPatch& boundaryPatch = patch();
		scalarField& field = *this;   
		
		scalar Ut = 8, hb = 5, z0 = 0.017; //input values
		scalar kappa = 0.41, Cmu = 0.09;
		
		const scalar u_star = (kappa * Ut) / log((hb + z0) / z0);
		const scalar k_inlet = (u_star * u_star) / sqrt(Cmu);
		
		forAll(field, faceI)
		{
			field[faceI] = k_inlet;
		}
		#};
			 
		codeOptions
		#{
		-I$(FOAM_SRC)/finiteVolume/lnInclude \
		-I$(FOAM_SRC)/meshTools/lnInclude
		#};
    }

    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    top
    {
        type            zeroGradient;
    }

    building
    {
        type            kqRWallFunction;
        value           $internalField;
    }

    ground
    {
        type            kqRWallFunction;
        value           $internalField;
    }

    "(front|back)"
    {
        type            empty;
    }
}


// ************************************************************************* //
